app/controllers/admin/emergencies_controller.rb

  def destroy
    @emergency.destroy
---
DELETE FROM "emergencies" WHERE "emergencies"."id" = $1  [["id", 12]]

  def find_emrgency
    @emergency = Emergency.find(params[:id])
---
SELECT  "emergencies".* FROM "emergencies" WHERE "emergencies"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]