app/controllers/admin/users_controller.rb

  def update
    if @user.update(params_for_user)
---
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "Danilo Korolevych"], ["updated_at", 2016-12-19 11:59:23 UTC], ["id", 2]]

  def toggle_active
    @user.toggle! :active
---
UPDATE "users" SET "active" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["active", false], ["updated_at", 2016-12-22 09:58:59 UTC], ["id", 8]]