app/views/users/show.slim

    p
    - @user.emergencies.each do |em|
---
SELECT "emergencies".* FROM "emergencies" WHERE "emergencies"."user_id" = ?  [["user_id", 2]]