amber_aler/app/views/messages/_list.html.slim

- emergency.messages.each do |message|
---
SELECT "messages".* FROM "messages" WHERE "messages"."emergency_id" = ?  [["emergency_id", 3]]