app/controllers/emergencies_controller.rb

  def create
    @emergency = Emergency.new(page_params)
    @emergency.user = current_user
    if @emergency.save
---
INSERT INTO "emergencies" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "dhgisdihds"], ["description", "<p>dikfodksok</p>"], ["user_id", 1], ["created_at", 2016-12-08 14:25:10 UTC], ["updated_at", 2016-12-08 14:25:10 UTC]]

  def update
    if @emergency.update(page_params)
---
UPDATE "emergencies" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "emergencies"."id" = ?

  def show
    @message = Message.new(emergency: @emergency)
    @messages = @emergency.messages.includes(:user).page(params[:page]).per(5)
---
SELECT  "messages".* FROM "messages" WHERE "messages"."emergency_id" = ? LIMIT ? OFFSET ?  [["emergency_id", 10], ["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "messages" WHERE "messages"."emergency_id" = ?  [["emergency_id", 10]]

  def destroy
    if @emergency.user == current_user
       @emergency.destroy
---
DELETE FROM "emergencies" WHERE "emergencies"."id" = ?  [["id", 12]]

    def find_emergency
      @emergency = Emergency.find(params[:id])
---
SELECT  "emergencies".* FROM "emergencies" WHERE "emergencies"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]