app/controllers/messages_controller.rb

INSERT INTO "messages" ("user_id", "emergency_id", "text", "claim_closed", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 1], ["emergency_id", 1], ["text", "<p>ьлімььалмьаь</p>"], ["claim_closed", false], ["created_at", 2016-12-15 12:53:38 UTC], ["updated_at", 2016-12-15 12:53:38 UTC]]
---
  def create
    @message = @emergency.messages.build(messages_params)
    @message.user_id = current_user.id
    if @message.save

SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "messages" WHERE "messages"."id" = ?  [["id", 7]]
---
  def destroy
    @message = Message.find(params[:id])
    if @message.destroy

SELECT  "emergencies".* FROM "emergencies" WHERE "emergencies"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
  def find_emergency
    @emergency = Emergency.find(params[:emergency_id])